![SPARK Banner](https://i.imgur.com/3vCmTns.png)

# SPARK | Day 2 | July 13th, 2021

The agenda for today:

1. Booleans & Conditionals
2. Aggregates
3. Peer Programming: Comprehension Questions
4. Data Scavenger Hunt
5. Peer Programming: Cleaning Your Dataset

# Cleaning Data Continued

In [2]:
# Import libraries
import pandas as pd
import numpy as np

# Create a list of missing values and save as a variable
missing_values = ['n/a', 'na', 'NaN', 'NA', '--']

# Read csv as as pandas data frame, but use the paramter na_values
df_property = pd.read_csv("https://raw.githubusercontent.com/nguyenjenny/spark_shared_repo/main/datasets/Property_Data.csv", na_values=missing_values)

# Replace "Hurley" with np.nan
df_property = df_property.replace("HURLEY", np.nan)


# Overwrite row 3, column "OWN_OCCUPIED" with np.nan
df_property.loc[3, "OWN_OCCUPIED"] = np.nan


# Show data frame
df_property

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT Extra
0  100001000.0   104.0      PUTNAM  ...        1  1000.0   NaN
1  100002000.0   197.0   LEXINGTON  ...      1.5     NaN   NaN
2  100003000.0     NaN   LEXINGTON  ...        1   850.0   NaN
3  100004000.0   201.0    BERKELEY  ...      NaN   700.0   NaN
4          NaN   203.0    BERKELEY  ...        2  1600.0   NaN
5  100006000.0   207.0    BERKELEY  ...        1   800.0   NaN
6  100007000.0     NaN  WASHINGTON  ...      NaN   950.0   NaN
7  100008000.0   213.0     TREMONT  ...        1     NaN   NaN
8  100009000.0   215.0     TREMONT  ...        2  1800.0   NaN

[9 rows x 8 columns]

## Dropping rows/indexes and columns with missing data (`dropna`)

Sometimes we may not want to use rows/indexes or columns if data is missing. This is where the  `dropna` function comes in handy.

Documentation for this function is found here: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html?highlight=dropna

Parameters: 


-  `axis`: the axis that you want to drop data on 
  - can be "index" or "columns"
  - `axis="index"` drops rows with missing data
  - `axis="columns"` drops columns with missing data

- `how`: how you want to drop the data
  - can be "any" or "all"
  - `how="any"` If any NA values are present, drop that row or column
  - `how="all"` If all values are NA, drop that row or column.



### Examples 
Drop columns where all the values are missing
```
df.dropna(axis="columns", how="all") 
```

Drop columns where there are any missing values
```
df.dropna(axis="columns", how="any") 
```

Drop rows/index where all the values are missing
```
df.dropna(axis="index", how="all") 
```

Drop rows/index where there are any missing values
```
df.dropna(axis="index", how="any") 
```

In [ ]:
# Drop columns where all values are missing
df_property.dropna(axis="columns", how="all")

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
# Drop columns where any values are missing
df_property.dropna(axis="columns", how="any")

      ST_NAME
0      PUTNAM
1   LEXINGTON
2   LEXINGTON
3    BERKELEY
4    BERKELEY
5    BERKELEY
6  WASHINGTON
7     TREMONT
8     TREMONT

In [ ]:
### TO-DO: drop rows/indexes where all values are missing

In [ ]:
### TO-DO: drop rows/indexes where any values are missing

#### Exercise 7: Drop rows/indexes where all and any of the data is missing.

# Booleans & Conditionals

## Why do we need conditionals?

Let's load up a small custom dataset we'll be using today and see what it looks like.

In [4]:
# import the libraries we need
import pandas as pd    
import numpy as np

# this is where the custom dataset is stored (its in .csv format)
url = "https://raw.githubusercontent.com/bilalhsyed/sparkdata/master/Day-2_hockey_stats.csv"

# reading the csv file from url into a variable, hockey_data
hockey_data = pd.read_csv(url)

# let's see what the data looks like
hockey_data

      Name GeneralPosition Position  GamesPlayed  Goals  Assists  Hits
0      Bob         Forward        C           42     16       12    28
1     John         Forward       RW           39     21        9    19
2  Jessica         Defense       LD           21      3        1    15
3   Andrew         Forward        C           27      8        2    21
4   Amanda         Defense       RD           18      5        8    17
5     Jack         Defense       RD           20      7       13    14
6   Andrea         Forward       LW           46     24       20    29
7    Chris         Defense       LD           35     14       13    22
8    Mitch         Forward       LW           33     12       24     9
9   Justin         Forward       RW           29     11       25    30

### Exercise 1: Selecting using .iloc

Now, let's select rows 1-3 of hockey_data.

**Hint**: Use .iloc

In [ ]:
## TO-DO: select rows 1-3 of hockey_data using .iloc
rows1to3 = hockey_data.iloc[1:4]

rows1to3

      Name GeneralPosition Position  GamesPlayed  Goals  Assists  Hits
1     John         Forward       RW           39     21        9    19
2  Jessica         Defense       LD           21      3        1    15
3   Andrew         Forward        C           27      8        2    21

### Exercise 2: Selecting using .loc

What if we only want the Name and Position columns?

**Hint:** Use .loc

In [ ]:
## TO-DO: select the Name and Position columns using .loc
nameAndpos = hockey_data.loc[:,["Name","Position"]]

nameAndpos

      Name Position
0      Bob        C
1     John       RW
2  Jessica       LD
3   Andrew        C
4   Amanda       RD
5     Jack       RD
6   Andrea       LW
7    Chris       LD
8    Mitch       LW
9   Justin       RW

Now, what if we want to select the players that have scored more than 10 goals?

We need a way to select rows and columns based on the values of the data within them. We need to select rows and columns when their values satisfy certain conditions.

In [ ]:
## TO-DO: Try to select the players that have scored more than 10 goals
players = hockey_data[hockey_data["Goals"]>10]
players

     Name GeneralPosition Position  GamesPlayed  Goals  Assists  Hits
0     Bob         Forward        C           42     16       12    28
1    John         Forward       RW           39     21        9    19
6  Andrea         Forward       LW           46     24       20    29
7   Chris         Defense       LD           35     14       13    22
8   Mitch         Forward       LW           33     12       24     9
9  Justin         Forward       RW           29     11       25    30

## Booleans

### True/False and Boolean Operators

Let's take a step back and understand how Python handles conditional expressions.

The data type that Python (and other programming languages as well) uses for this is the **boolean**.

Booleans represent whether something (an expression) is True or False. Let's take a look at some examples. Think about whether each expression is True or False before running the cell to see what Python tells you (in the form of a boolean).

We can use the "greater than", "less than", "equal to", and "not equal to" operators.

In [ ]:
5 > 4

In [ ]:
100 < -1

In [ ]:
"hello" == "hello"

In [ ]:
"hello" != "hello"

We can combine some of these operators as follows.

In [ ]:
4 >= 3

In [ ]:
100 <= 99

We can also combine multiple expressions by using the operators **and (&)**, **or (|)**, and **not**. Let's see some examples.

In [ ]:
(4 > 3) and (3 > 3)

The **and** operator checks that BOTH (or ALL) expressions are True.

What do you think the **or** operator does?

In [ ]:
("spark" == "spark") or (1000 >= 999)

The **or** operator checks that atleast ONE of the expressions is True.

How about the **not** operator?

In [ ]:
not (1000 > 999)

The **not** operator checks if its related expression is not True.

Let's try applying what we've learnt.

### Exercise 3: Booleans

Complete the following expressions so that the intended result is achieved.

In [ ]:
## TO-DO: False
("hello" == "why") and (3.9 <= 4.2)

False

In [ ]:
## TO-DO: True
("hello" != "why") and not (3.9 == 4.2)

True

## Conditional expression in Pandas

Let's get back to our original problem: We need to select the players that have scored more than 10 goals.

Let's see our dataset again.

In [ ]:
hockey_data

      Name GeneralPosition Position  GamesPlayed  Goals  Assists  Hits
0      Bob         Forward        C           42     16       12    28
1     John         Forward       RW           39     21        9    19
2  Jessica         Defense       LD           21      3        1    15
3   Andrew         Forward        C           27      8        2    21
4   Amanda         Defense       RD           18      5        8    17
5     Jack         Defense       RD           20      7       13    14
6   Andrea         Forward       LW           46     24       20    29
7    Chris         Defense       LD           35     14       13    22
8    Mitch         Forward       LW           33     12       24     9
9   Justin         Forward       RW           29     11       25    30

Can we check if a whole column satisfies a condition? YES!

In [ ]:
hockey_data["Goals"] > 10

This is how we can check which values in the Goals column are greater than 10.

We can see that Python checks each value one-by-one and tells us if the condition returned True or False. For example, the 3rd player, Jessica, scored only 3 goals, so the 3rd value is False.

However, we don't just want a bunch of booleans. We want to know which PLAYERS scored more than 10 goals!

In [ ]:
hockey_data[hockey_data["Goals"] > 10]

The above statement checks which rows in the Goals column satisfies our condition and then gets us ONLY those rows from the hockey_data dataframe.

Let's try conditionally selecting some other rows from hockey_data.

### Exercise 4: Conditional Expressions in Pandas

In [ ]:
# TO-DO: Select the players that play the Forward position

In [ ]:
# TO-DO: Select the players that played less than 20 games AND had more than 15 hits

# Aggregates

## Aggregate Methods

Pandas dataframes provide us with some very useful aggregate methods. We can use these, such as describe(), mean(), sum(), etc., to better understand our data quickly.

Let's take a look at some of these.

In [6]:
hockey_data.sum()

Name               BobJohnJessicaAndrewAmandaJackAndreaChrisMitch...
GeneralPosition    ForwardForwardDefenseForwardDefenseDefenseForw...
Position                                          CRWLDCRDRDLWLDLWRW
GamesPlayed                                                      310
Goals                                                            121
Assists                                                          127
Hits                                                             204
dtype: object

[DATAFRAME].sum() adds up all of the values in each column. Notice what its done with the **str** values.

In [8]:
hockey_data.mean()

GamesPlayed    31.0
Goals          12.1
Assists        12.7
Hits           20.4
dtype: float64

[DATAFRAME].mean() calculates the mean for each column. Did you notice what it does to columns that don't contain **int**/**float** values?

In [5]:
hockey_data.describe()

       GamesPlayed      Goals    Assists       Hits
count    10.000000  10.000000  10.000000  10.000000
mean     31.000000  12.100000  12.700000  20.400000
std       9.660918   6.806043   8.300602   6.995236
min      18.000000   3.000000   1.000000   9.000000
25%      22.500000   7.250000   8.250000  15.500000
50%      31.000000  11.500000  12.500000  20.000000
75%      38.000000  15.500000  18.250000  26.500000
max      46.000000  24.000000  25.000000  30.000000

[DATAFRAME].describe() is a useful method to calculate various statistical aggregates for **int**/**float** values together.

### Exercise 5: Useful Aggregate Methods

Can you find out how to calculate the median for each column using an aggregate method?

In [ ]:
## TO-DO: calculate the median for hockey_stats

## Group-By

Sometimes, we'll want to calculate these statistics for groupings within our given data. This is made easy for us as well!

We can do this by using the code:

[DATA_VARIABLE].groupby([COLUMN_NAME]).[AGGREGATE_METHOD]

In [6]:
hockey_data.groupby('GeneralPosition').mean()

                 GamesPlayed      Goals    Assists       Hits
GeneralPosition
Defense                 23.5   7.250000   8.750000  17.000000
Forward                 36.0  15.333333  15.333333  22.666667

Let's try grouping by both "GeneralPosition" and "Position"!

### Exercise 6: Group-By

In [9]:
## TO-DO: Calculate the median of hockey_data after grouping by both General Position and Position
hockey_data.groupby(['GeneralPosition', 'Position']).mean()

                          GamesPlayed  Goals  Assists  Hits
GeneralPosition Position
Defense         LD               28.0    8.5      7.0  18.5
                RD               19.0    6.0     10.5  15.5
Forward         C                34.5   12.0      7.0  24.5
                LW               39.5   18.0     22.0  19.0
                RW               34.0   16.0     17.0  24.5

# Peer Programming: Comprehension Questions

Please use the dataset available here: https://raw.githubusercontent.com/bilalhsyed/sparkdata/master/StudentsPerformance.csv

Using this dataset, please complete the following tasks:

**NOTE:** Use formatted print statements to display your answers.

## Task 1

In [11]:
## TO-DO: Import the relevant libraries
import pandas as pd
import numpy as np

## TO-DO: Read the .csv file
student_data = pd.read_csv("https://raw.githubusercontent.com/bilalhsyed/sparkdata/master/StudentsPerformance.csv")

## TO-DO: Display the contents of the file to see what it looks like
student_data

     gender race/ethnicity  ... reading score writing score
0    female        group B  ...            72            74
1    female        group C  ...            90            88
2    female        group B  ...            95            93
3      male        group A  ...            57            44
4      male        group C  ...            78            75
..      ...            ...  ...           ...           ...
995  female        group E  ...            99            95
996    male        group C  ...            55            55
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[1000 rows x 8 columns]

## Task 2

In [29]:
## TO-DO: Select the 3 test scores (math score, reading score, writing score) of students that are female and have a standard lunch
female_students = student_data[(student_data["gender"]=="female")&(student_data["lunch"]=="standard")]
female_students =female_students.loc[:,["math score","reading score","writing score"]]
female_students

## TO-DO: How many students satisfy the above requirements?


## TO-DO: What is the mean math score for these students?


## TO-DO: What is the median reading score for these students?


## TO-DO: What is the min/max writing score for these students?

     math score  reading score  writing score
0            72             72             74
1            69             90             88
2            90             95             93
5            71             83             78
6            88             95             92
..          ...            ...            ...
984          74             75             82
986          40             59             51
991          65             82             78
995          88             99             95
998          68             78             77

[329 rows x 3 columns]

## Task 3

In [ ]:
## TO-DO: Select the students who are in Group B, didn't complete the test preparation course, and scored 70+ in atleast 1 of the tests


## TO-DO: How many students satisfy the above requirements?


## TO-DO: How many of these students are male?


## TO-DO: Perform an aggregate statistical test of your choosing (besides the ones from Task 2) on the selected students and report your results

## Task 4

In [ ]:
## TO-DO: What is the median math score for female students in Group C with parents that have completed a bachelor's degree? Use .groupby()


## TO-DO: What is the mean reading score for students in Group A with a standard lunch? Use .groupby()


## TO-DO: What is the minimum writing score for male students that completed the test preparation course with parents that have completed high school? Use .groupby()

# Data Scavenger Hunt

In [1]:
# Import libraries
import pandas as pd
import numpy as np

# Peer Programming: Cleaning Your Dataset

In [2]:
# Create a list of missing values and save as a variable
missing_values = ['n/a', 'na', 'NaN', 'NA', '--']

charactersList = pd.read_csv("https://raw.githubusercontent.com/nguyenjenny/spark_shared_repo/main/datasets/characters.csv", na_values=missing_values)
charactersList

                     Name  Height  Mass  ...  Gender  Homeworld       Species
0                  Ackbar   180.0  83.0  ...    Male   Mon Cala  Mon Calamari
1              Adi Gallia   184.0  50.0  ...  Female  Coruscant    Tholothian
2        Anakin Skywalker   188.0  84.0  ...    Male   Tatooine         Human
3            Arvel Crynyd     NaN   NaN  ...    Male        NaN         Human
4             Ayla Secura   178.0  55.0  ...  Female     Ryloth       Twi'lek
..                    ...     ...   ...  ...     ...        ...           ...
82  Wicket Systri Warrick    88.0  20.0  ...    Male      Endor          Ewok
83         Wilhuff Tarkin   180.0   NaN  ...    Male     Eriadu         Human
84            Yarael Poof   264.0   NaN  ...    Male    Quermia      Quermian
85                   Yoda    66.0  17.0  ...    Male        NaN           NaN
86             Zam Wesell   168.0  55.0  ...  Female      Zolan      Clawdite

[87 rows x 11 columns]